Revit 2026 API

# WireSizeSetIteratorCurrent Property

---

Retrieves the item that is the current focus of the iterator.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Object Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As Object
	Get
```
```cpp
public:
virtual property Object^ Current {
	Object^ get ();
}
```
```fsharp
abstract Current : Object with get
override Current : Object with get
```

#### Property Value

Object

#### Implements

IEnumeratorCurrent

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

#### Reference

WireSizeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace